app/views/flats/index.html.erb

SELECT "flats".* FROM "flats"
SELECT 1 AS one FROM "flats" INNER JOIN "bookings" ON "flats"."id" = "bookings"."flat_id" WHERE "bookings"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---

<!--   <%# if current_user.flats.empty? %>