app/views/bookings/my_bookings.html.erb

SELECT "flats".* FROM "flats" WHERE "flats"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
      <div class="card" style="width: 18rem;">
       <%= cl_image_tag booking.flat.photos.first.key, class:"card-img-top" %>