app/views/users/my_flats.html.erb

SELECT "flats".* FROM "flats" WHERE "flats"."user_id" = $1  [["user_id", 3]]
SELECT 1 AS one FROM "flats" INNER JOIN "bookings" ON "flats"."id" = "bookings"."flat_id" WHERE "bookings"."user_id" = $1 LIMIT $2  [["user_id", 3], ["LIMIT", 1]]
---

  <% if current_user.flats.empty? %>

SELECT "bookings".* FROM "bookings" WHERE "bookings"."user_id" = $1  [["user_id", 3]]
---
                <% if flat.photos.attached? %>
                  <li class="booking-card" style="background-image: url('<%=cl_image_path flat.photos.first.key, crop: :fill %>')">