app/controllers/bookings_controller.rb

SELECT "flats".* FROM "flats" WHERE "flats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @booking = Booking.new
    @flat = Flat.find(params[:flat_id])

SELECT "flats".* FROM "flats" WHERE "flats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "bookings" ("user_id", "flat_id", "check_in", "check_out", "message", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["user_id", 1], ["flat_id", 1], ["check_in", "2021-02-25"], ["check_out", "2021-02-25"], ["message", ""], ["created_at", "2021-02-25 14:28:00.102164"], ["updated_at", "2021-02-25 14:28:00.102164"]]
---
  def create
    @booking = Booking.new(booking_params)
    @booking.user = current_user
    @flat = Flat.find(params[:flat_id])
    @booking.flat = @flat
    if @booking.save