app/controllers/flats_controller.rb

  def index
    if params[:location_id] == "Where in the Wizarding world would you like to go?"|| params[:location_id].nil?
      @flats = Flat.all
      @title = "Explore all the magical flats in the Wizarding world"
    else
      location = Location.find(params[:location_id])
      @flats = Flat.where(location: location)
---
SELECT "flats".* FROM "flats"
SELECT "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]
SELECT "flats".* FROM "flats" WHERE "flats"."location_id" = $1  [["location_id", 29]]

  def show
    @flat = Flat.find(params[:id])
---
SELECT "flats".* FROM "flats" WHERE "flats"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def create
    @flat = Flat.new(flat_params)
    @flat.user = current_user
    if @flat.save
---
INSERT INTO "flats" ("title", "description", "created_at", "updated_at", "location_id", "user_id", "price") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "Flat"], ["description", "Magical Flat "], ["created_at", "2021-02-26 13:29:48.760150"], ["updated_at", "2021-02-26 13:29:48.760150"], ["location_id", 29], ["user_id", 3], ["price", 100]]

  def update
    @flat = Flat.find(params[:id])
    if @flat.update(flat_params)
---
UPDATE "flats" SET "updated_at" = $1 WHERE "flats"."id" = $2  [["updated_at", "2021-02-26 13:29:49.031892"], ["id", 8]]