app/controllers/pages_controller.rb

SELECT "locations".* FROM "locations"
---
  def home
    # @locations = Flat.all.map do |flat|
    #   flat.location.name
    # end

    @locations = Location.all