app/controllers/users_controller.rb

  def my_flats
    @flats = Flat.where(user: current_user)
---
SELECT "flats".* FROM "flats" WHERE "flats"."user_id" = $1  [["user_id", 3]]